{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "&",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "?",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|-|\\+|\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "^",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "&",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "&": {
        "id": "&",
        "ids": [
          1
        ],
        "tokens": [
          "&"
        ]
      },
      "^": {
        "id": "^",
        "ids": [
          0
        ],
        "tokens": [
          "^"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "^": 0,
      "&": 1,
      " ": 2,
      "?": 3,
      "c": 4,
      "C": 5,
      "(": 6,
      ")": 7,
      "O": 8,
      "1": 9,
      "=": 10,
      "2": 11,
      "N": 12,
      ".": 13,
      "n": 14,
      "Cl": 15,
      "F": 16,
      "3": 17,
      ">>": 18,
      "-": 19,
      "S": 20,
      "[O-]": 21,
      "4": 22,
      "Br": 23,
      "[C@@H]": 24,
      "[C@H]": 25,
      "#": 26,
      "[Na+]": 27,
      "[nH]": 28,
      "[N+]": 29,
      "s": 30,
      "[K+]": 31,
      "o": 32,
      "/": 33,
      "[OH-]": 34,
      "5": 35,
      "I": 36,
      "[Si]": 37,
      "[P]": 38,
      "P": 39,
      "[Pd]": 40,
      "B": 41,
      "[Cl-]": 42,
      "[H-]": 43,
      "[N-]": 44,
      "[Li+]": 45,
      "[C@]": 46,
      "[Cs+]": 47,
      "[NH4+]": 48,
      "[H]": 49,
      "[C@@]": 50,
      "\\": 51,
      "[Li]": 52,
      "[P-]": 53,
      "6": 54,
      "[BH4-]": 55,
      "[Cu]": 56,
      "[I-]": 57,
      "[Mg]": 58,
      "[Sn]": 59,
      "[Br-]": 60,
      "[BH-]": 61,
      "[n+]": 62,
      "[F-]": 63,
      "[P+]": 64,
      "[Na]": 65,
      "[C-]": 66,
      "[Pd+2]": 67,
      "[BH3-]": 68,
      "[B-]": 69,
      "[AlH4-]": 70,
      "[Al+3]": 71,
      "[Ni]": 72,
      "[c-]": 73,
      "[Zn]": 74,
      "[Fe]": 75,
      "[C]": 76,
      "[SiH]": 77,
      "[Pt]": 78,
      "[Mn]": 79,
      "[nH+]": 80,
      "[Zn+2]": 81,
      "[AlH]": 82,
      "7": 83,
      "[Cr]": 84,
      "[Fe+2]": 85,
      "[S-]": 86,
      "[Al]": 87,
      "[Mg+2]": 88,
      "[K]": 89,
      "[Cu+2]": 90,
      "[NH3+]": 91,
      "[Ca+2]": 92,
      "[Ti]": 93,
      "[SiH2]": 94,
      "[I+3]": 95,
      "[NH2+]": 96,
      "[NH+]": 97,
      "[Ru]": 98,
      "[PH]": 99,
      "[S+]": 100,
      "[O+]": 101,
      "[S@]": 102,
      "[Os]": 103,
      "[B]": 104,
      "[S@@]": 105,
      "[Ag+]": 106,
      "[Se]": 107,
      "[Cl+3]": 108,
      "[O-2]": 109,
      "[Zn+]": 110,
      "[Ti+4]": 111,
      "[Cl+]": 112,
      "[Rh]": 113,
      "[Mg+]": 114,
      "[se]": 115,
      "[SnH]": 116,
      "[H+]": 117,
      "8": 118,
      "[Al+]": 119,
      "[Ag]": 120,
      "[Hg]": 121,
      "[SiH3]": 122,
      "[Ag+2]": 123,
      "[NH2-]": 124,
      "[PH2]": 125,
      "[S]": 126,
      "[NH-]": 127,
      "[Ba+2]": 128,
      "[AlH2-]": 129,
      "[Sn+2]": 130,
      "[O]": 131,
      "[SH]": 132,
      "[Yb+3]": 133,
      "[Co]": 134,
      "[CH]": 135,
      "[Pb+2]": 136,
      "[n-]": 137,
      "[cH-]": 138,
      "[Bi]": 139,
      "[S-2]": 140,
      "[Pd+]": 141,
      "[SH-]": 142,
      "[Mn+2]": 143,
      "[PH+]": 144,
      "[W]": 145,
      "[Ti+3]": 146,
      "[As]": 147,
      "[Rh+2]": 148,
      "9": 149,
      "[Zr+4]": 150,
      "[Au]": 151,
      "[Pb+4]": 152,
      "[I+]": 153,
      "[Mo]": 154,
      "[Co+2]": 155,
      "[CH2-]": 156,
      "[Ca]": 157,
      "[In+3]": 158,
      "[Sb]": 159,
      "[Pt-2]": 160,
      "[Ce+3]": 161,
      "[I+2]": 162,
      "[Si@@H]": 163,
      "[Ce]": 164,
      "[In]": 165,
      "[Cu+]": 166,
      "p": 167,
      "[Ge]": 168,
      "[Cr+3]": 169,
      "[C+]": 170,
      "[2H]": 171,
      "[Br+2]": 172,
      "[Ir]": 173,
      "[Te]": 174,
      "[SiH4]": 175,
      "[s+]": 176,
      "[V]": 177,
      "[PH3+]": 178,
      "[Sc+3]": 179,
      "[N@@]": 180,
      "[Re]": 181,
      "[Hg+2]": 182,
      "[Pb]": 183,
      "[Sn+]": 184,
      "[Fe+3]": 185,
      "[Ni+2]": 186,
      "[CH2+]": 187,
      "[Zr]": 188,
      "[te]": 189,
      "[Pb+3]": 190,
      "[SeH]": 191,
      "[Fe-3]": 192,
      "[Al+2]": 193,
      "[o+]": 194,
      "[Bi+3]": 195,
      "[Rh+3]": 196,
      "[CH-]": 197,
      "[N]": 198,
      "[P@]": 199,
      "%10": 200,
      "[Cl+2]": 201,
      "[Cd+2]": 202,
      "[C+4]": 203,
      "[B+]": 204,
      "[CH3-]": 205,
      "[SnH3]": 206,
      "[Zr+2]": 207,
      "[AlH-]": 208,
      "%11": 209,
      "[N@]": 210,
      "[Sb-]": 211,
      "[Ti+2]": 212,
      "[Cs]": 213,
      "[La+3]": 214,
      "[PH4+]": 215,
      "[Sn+4]": 216,
      "[Sr+2]": 217,
      "[IH+]": 218,
      "[Y+3]": 219,
      "[P+3]": 220,
      "[Cr+6]": 221,
      "[IH2+]": 222,
      "[Ni+3]": 223,
      "[Si-]": 224,
      "[Ru+]": 225,
      "[SH2]": 226,
      "[Tl+]": 227,
      "[Ga]": 228,
      "[Nb+5]": 229,
      "[P+5]": 230,
      "[Rh+]": 231,
      "[Ga+3]": 232,
      "[Ba]": 233,
      "[I]": 234,
      "[P@@]": 235,
      "[PH3]": 236,
      "[SH+]": 237,
      "[V+5]": 238,
      "[Eu]": 239,
      "[SnH4]": 240,
      "[Sm+2]": 241,
      "[Ta]": 242,
      "[Hg+]": 243,
      "[SnH2]": 244,
      "[Hf+4]": 245,
      "[Nd+3]": 246,
      "[Xe]": 247,
      "[3H]": 248,
      "[AlH3]": 249,
      "[Cr+2]": 250,
      "[IH]": 251,
      "[Ce+4]": 252,
      "[Mn+3]": 253,
      "[Si+4]": 254,
      "[Si@H]": 255,
      "[Sm+3]": 256,
      "[Tl]": 257,
      "[c+]": 258,
      "[Au-]": 259,
      "[CH+]": 260,
      "[Dy+3]": 261,
      "[Gd+3]": 262,
      "[Nd]": 263,
      "[Rb+]": 264,
      "[Sb+3]": 265,
      "[Ar]": 266,
      "[B+3]": 267,
      "[Cd]": 268,
      "[PH5]": 269,
      "[Br]": 270,
      "[Cl]": 271,
      "[Eu+3]": 272,
      "[La]": 273,
      "[N@+]": 274,
      "[Ru+2]": 275,
      "[SiH-]": 276,
      "[TeH]": 277,
      "[Yb]": 278,
      "[sH+]": 279,
      "[Al-]": 280,
      "[N@@+]": 281,
      "[Pr+3]": 282,
      "[Sc]": 283,
      "[Sm]": 284,
      "[pH]": 285,
      "[PdH2]": 286,
      "[Pt+2]": 287,
      "[SH2+]": 288,
      "[Si+]": 289,
      "[Tl+3]": 290,
      "[Y]": 291,
      "%12": 292,
      "[GeH]": 293,
      "[Se-]": 294,
      "[SeH-]": 295,
      "[Sn+3]": 296,
      "[CH3+]": 297,
      "[Co+3]": 298,
      "[Hf]": 299,
      "[PH4]": 300,
      "[Ta+5]": 301,
      "[Tl+2]": 302,
      "[Zr+3]": 303,
      "[cH+]": 304,
      "%13": 305,
      "%14": 306,
      "%15": 307,
      "%16": 308,
      "%17": 309,
      "[Au+]": 310,
      "[Er+3]": 311,
      "[Fe+5]": 312,
      "[Fe-4]": 313,
      "[Ga+]": 314,
      "[Gd]": 315,
      "[Hf+2]": 316,
      "[Sb+5]": 317,
      "[Se-2]": 318,
      "[Ti+]": 319,
      "[U+6]": 320,
      "b": 321,
      "[131I]": 322,
      "[32P]": 323,
      "[AsH2]": 324,
      "[AsH]": 325,
      "[BH]": 326,
      "[Be+2]": 327,
      "[Cr+4]": 328,
      "[In+]": 329,
      "[Mg+4]": 330,
      "[Mo+2]": 331,
      "[Ni+]": 332,
      "[OH+]": 333,
      "[OH3+]": 334,
      "[PH2+]": 335,
      "[Ru+3]": 336,
      "[Th]": 337,
      "[U+2]": 338,
      "[U]": 339,
      "[V+2]": 340,
      "[se+]": 341,
      "%18": 342,
      "%19": 343,
      "%20": 344,
      "%21": 345,
      "%22": 346,
      "%23": 347,
      "[11CH3]": 348,
      "[123I-]": 349,
      "[Ag+3]": 350,
      "[Ag-]": 351,
      "[Al-3]": 352,
      "[Bi+2]": 353,
      "[BrH+]": 354,
      "[Ga+2]": 355,
      "[He]": 356,
      "[Ir+3]": 357,
      "[Mn+5]": 358,
      "[Mo+4]": 359,
      "[N+3]": 360,
      "[N@@H+]": 361,
      "[Nb]": 362,
      "[Pd+3]": 363,
      "[SeH2]": 364,
      "[Tc]": 365,
      "[125I]": 366,
      "[13C]": 367,
      "[18F]": 368,
      "[99Tc+4]": 369,
      "[99Tc]": 370,
      "[Ag-2]": 371,
      "[AlH2+]": 372,
      "[As+]": 373,
      "[As-]": 374,
      "[AsH+]": 375,
      "[AsH3]": 376,
      "[Au+3]": 377,
      "[Au-2]": 378,
      "[B+2]": 379,
      "[BiH3]": 380,
      "[Br+]": 381,
      "[CH2]": 382,
      "[Cr-]": 383,
      "[Cu+4]": 384,
      "[Cu-2]": 385,
      "[Cu-]": 386,
      "[Dy]": 387,
      "[F]": 388,
      "[Ge+3]": 389,
      "[GeH3]": 390,
      "[HH]": 391,
      "[HeH]": 392,
      "[Hf+3]": 393,
      "[Hg-2]": 394,
      "[I+7]": 395,
      "[MgH]": 396,
      "[Mn+4]": 397,
      "[Mn+6]": 398,
      "[Mn+]": 399,
      "[Nd+]": 400,
      "[Ne]": 401,
      "[OH2+]": 402,
      "[OH]": 403,
      "[P+2]": 404,
      "[P-3]": 405,
      "[Pd-2]": 406,
      "[Pt+]": 407,
      "[Pt-]": 408,
      "[Re+5]": 409,
      "[SH3+]": 410,
      "[Si@@]": 411,
      "[Si@]": 412,
      "[Sr]": 413,
      "[Ta+2]": 414,
      "[Th+4]": 415,
      "[Ti+5]": 416,
      "[V+3]": 417,
      "[W+6]": 418,
      "[Yb+2]": 419,
      "[siH]": 420
    },
    "unk_token": "?"
  }
}